Revit 2026 API

# GeometryInstanceTransform Property

---

The affine transformation from the local coordinate space of the symbol into the coordinate space of the instance.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Transform Transform { get; }
```
```vb
Public ReadOnly Property Transform As Transform
	Get
```
```cpp
public:
property Transform^ Transform {
	Transform^ get ();
}
```
```fsharp
member Transform : Transform with get
```

#### Property Value

Transform

#### Reference

GeometryInstance Class

Autodesk.Revit.DB Namespace